Revit 2027 API
ViewDisplayBackground.CreateGradient Method
 Creates an object that can be passed to View.SetBackground method to set the background of the Gradient type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ViewDisplayBackground CreateGradient(
	Color skyColor,
	Color horizonColor,
	Color groundColor
)
Public Shared Function CreateGradient (
	skyColor As Color,
	horizonColor As Color,
	groundColor As Color
) As ViewDisplayBackground
public:
static ViewDisplayBackground^ CreateGradient(
	Color^ skyColor,
	Color^ horizonColor,
	Color^ groundColor
)
static member CreateGradient :
        skyColor : Color *
        horizonColor : Color *
        groundColor : Color -> ViewDisplayBackground
Parameters
skyColor Color
 The top of the sky gradient if the sky is visible.
horizonColor Color
 The bottom or the sky gradient if the sky is visible, or the top of the ground gradient otherwise.
groundColor Color
 The ground color if the sky is visible (ground shown in uniform color), or the bottom of the ground gradient if the sky is not visible.
Return Value
ViewDisplayBackground
 New background object to pass to View.SetBackground.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ViewDisplayBackground Class
Autodesk.Revit.DB Namespace